Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hemc.h
/**
 * \brief Component description for HEMC
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-01-08T10:06:16Z */
#ifndef _SAMRH71_HEMC_COMPONENT_H_
#define _SAMRH71_HEMC_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR HEMC                                         */
/* ************************************************************************** */

/* -------- HEMC_CR_NCS0 : (HEMC Offset: 0x00) (R/W 32) HEMC Control Register NCS 0 -------- */
#define HEMC_CR_NCS0_ZERO_Pos                 _U_(0)                                               /**< (HEMC_CR_NCS0) fixed to 0 Position */
#define HEMC_CR_NCS0_ZERO_Msk                 (_U_(0x1) << HEMC_CR_NCS0_ZERO_Pos)                  /**< (HEMC_CR_NCS0) fixed to 0 Mask */
#define HEMC_CR_NCS0_ZERO(value)              (HEMC_CR_NCS0_ZERO_Msk & ((value) << HEMC_CR_NCS0_ZERO_Pos))
#define HEMC_CR_NCS0_BANKSIZE_Pos             _U_(1)                                               /**< (HEMC_CR_NCS0) Bank Size Position */
#define HEMC_CR_NCS0_BANKSIZE_Msk             (_U_(0x1F) << HEMC_CR_NCS0_BANKSIZE_Pos)             /**< (HEMC_CR_NCS0) Bank Size Mask */
#define HEMC_CR_NCS0_BANKSIZE(value)          (HEMC_CR_NCS0_BANKSIZE_Msk & ((value) << HEMC_CR_NCS0_BANKSIZE_Pos))
#define   HEMC_CR_NCS0_BANKSIZE_8KB_Val       _U_(0x0)                                             /**< (HEMC_CR_NCS0) 8Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_16KB_Val      _U_(0x1)                                             /**< (HEMC_CR_NCS0) 16Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_32KB_Val      _U_(0x2)                                             /**< (HEMC_CR_NCS0) 32Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_64KB_Val      _U_(0x3)                                             /**< (HEMC_CR_NCS0) 64Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_128KB_Val     _U_(0x4)                                             /**< (HEMC_CR_NCS0) 128Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_256KB_Val     _U_(0x5)                                             /**< (HEMC_CR_NCS0) 256Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_512KB_Val     _U_(0x6)                                             /**< (HEMC_CR_NCS0) 512Kbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_1MB_Val       _U_(0x7)                                             /**< (HEMC_CR_NCS0) 1Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_2MB_Val       _U_(0x8)                                             /**< (HEMC_CR_NCS0) 2Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_4MB_Val       _U_(0x9)                                             /**< (HEMC_CR_NCS0) 4Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_8MB_Val       _U_(0xA)                                             /**< (HEMC_CR_NCS0) 8Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_16MB_Val      _U_(0xB)                                             /**< (HEMC_CR_NCS0) 16Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_32MB_Val      _U_(0xC)                                             /**< (HEMC_CR_NCS0) 32Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_64MB_Val      _U_(0xD)                                             /**< (HEMC_CR_NCS0) 64Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_128MB_Val     _U_(0xE)                                             /**< (HEMC_CR_NCS0) 128Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_256MB_Val     _U_(0xF)                                             /**< (HEMC_CR_NCS0) 256Mbytes (Default)  */
#define   HEMC_CR_NCS0_BANKSIZE_512MB_Val     _U_(0x10)                                            /**< (HEMC_CR_NCS0) 512Mbytes  */
#define   HEMC_CR_NCS0_BANKSIZE_NOT_USED_Val  _U_(0x1F)                                            /**< (HEMC_CR_NCS0) NOT_USED  */
#define HEMC_CR_NCS0_BANKSIZE_8KB             (HEMC_CR_NCS0_BANKSIZE_8KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 8Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_16KB            (HEMC_CR_NCS0_BANKSIZE_16KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 16Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_32KB            (HEMC_CR_NCS0_BANKSIZE_32KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 32Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_64KB            (HEMC_CR_NCS0_BANKSIZE_64KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 64Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_128KB           (HEMC_CR_NCS0_BANKSIZE_128KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 128Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_256KB           (HEMC_CR_NCS0_BANKSIZE_256KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 256Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_512KB           (HEMC_CR_NCS0_BANKSIZE_512KB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 512Kbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_1MB             (HEMC_CR_NCS0_BANKSIZE_1MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 1Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_2MB             (HEMC_CR_NCS0_BANKSIZE_2MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 2Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_4MB             (HEMC_CR_NCS0_BANKSIZE_4MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 4Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_8MB             (HEMC_CR_NCS0_BANKSIZE_8MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 8Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_16MB            (HEMC_CR_NCS0_BANKSIZE_16MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 16Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_32MB            (HEMC_CR_NCS0_BANKSIZE_32MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 32Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_64MB            (HEMC_CR_NCS0_BANKSIZE_64MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 64Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_128MB           (HEMC_CR_NCS0_BANKSIZE_128MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 128Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_256MB           (HEMC_CR_NCS0_BANKSIZE_256MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 256Mbytes (Default) Position  */
#define HEMC_CR_NCS0_BANKSIZE_512MB           (HEMC_CR_NCS0_BANKSIZE_512MB_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) 512Mbytes Position  */
#define HEMC_CR_NCS0_BANKSIZE_NOT_USED        (HEMC_CR_NCS0_BANKSIZE_NOT_USED_Val << HEMC_CR_NCS0_BANKSIZE_Pos) /**< (HEMC_CR_NCS0) NOT_USED Position  */
#define HEMC_CR_NCS0_TYPE_Pos                 _U_(6)                                               /**< (HEMC_CR_NCS0) type of memory used Position */
#define HEMC_CR_NCS0_TYPE_Msk                 (_U_(0x1) << HEMC_CR_NCS0_TYPE_Pos)                  /**< (HEMC_CR_NCS0) type of memory used Mask */
#define HEMC_CR_NCS0_TYPE(value)              (HEMC_CR_NCS0_TYPE_Msk & ((value) << HEMC_CR_NCS0_TYPE_Pos))
#define HEMC_CR_NCS0_ADDBASE_Pos              _U_(7)                                               /**< (HEMC_CR_NCS0) relative base address of NCS area Position */
#define HEMC_CR_NCS0_ADDBASE_Msk              (_U_(0x3FFFF) << HEMC_CR_NCS0_ADDBASE_Pos)           /**< (HEMC_CR_NCS0) relative base address of NCS area Mask */
#define HEMC_CR_NCS0_ADDBASE(value)           (HEMC_CR_NCS0_ADDBASE_Msk & ((value) << HEMC_CR_NCS0_ADDBASE_Pos))
#define HEMC_CR_NCS0_WRITE_ECC_CONF_Pos       _U_(29)                                              /**< (HEMC_CR_NCS0) ECC Configuration Protection Enable Position */
#define HEMC_CR_NCS0_WRITE_ECC_CONF_Msk       (_U_(0x1) << HEMC_CR_NCS0_WRITE_ECC_CONF_Pos)        /**< (HEMC_CR_NCS0) ECC Configuration Protection Enable Mask */
#define HEMC_CR_NCS0_WRITE_ECC_CONF(value)    (HEMC_CR_NCS0_WRITE_ECC_CONF_Msk & ((value) << HEMC_CR_NCS0_WRITE_ECC_CONF_Pos))
#define HEMC_CR_NCS0_ECC_ENABLE_Pos           _U_(30)                                              /**< (HEMC_CR_NCS0) ECC Protection Enable Position */
#define HEMC_CR_NCS0_ECC_ENABLE_Msk           (_U_(0x1) << HEMC_CR_NCS0_ECC_ENABLE_Pos)            /**< (HEMC_CR_NCS0) ECC Protection Enable Mask */
#define HEMC_CR_NCS0_ECC_ENABLE(value)        (HEMC_CR_NCS0_ECC_ENABLE_Msk & ((value) << HEMC_CR_NCS0_ECC_ENABLE_Pos))
#define HEMC_CR_NCS0_ECC12_ENABLE_Pos         _U_(31)                                              /**< (HEMC_CR_NCS0) BCH ECC Enable Position */
#define HEMC_CR_NCS0_ECC12_ENABLE_Msk         (_U_(0x1) << HEMC_CR_NCS0_ECC12_ENABLE_Pos)          /**< (HEMC_CR_NCS0) BCH ECC Enable Mask */
#define HEMC_CR_NCS0_ECC12_ENABLE(value)      (HEMC_CR_NCS0_ECC12_ENABLE_Msk & ((value) << HEMC_CR_NCS0_ECC12_ENABLE_Pos))
#define HEMC_CR_NCS0_Msk                      _U_(0xE1FFFFFF)                                      /**< (HEMC_CR_NCS0) Register Mask  */


/* -------- HEMC_CR_NCS1 : (HEMC Offset: 0x04) (R/W 32) HEMC Control Register NCS 1 -------- */
#define HEMC_CR_NCS1_ZERO_Pos                 _U_(0)                                               /**< (HEMC_CR_NCS1) fixed to 0 Position */
#define HEMC_CR_NCS1_ZERO_Msk                 (_U_(0x1) << HEMC_CR_NCS1_ZERO_Pos)                  /**< (HEMC_CR_NCS1) fixed to 0 Mask */
#define HEMC_CR_NCS1_ZERO(value)              (HEMC_CR_NCS1_ZERO_Msk & ((value) << HEMC_CR_NCS1_ZERO_Pos))
#define HEMC_CR_NCS1_BANKSIZE_Pos             _U_(1)                                               /**< (HEMC_CR_NCS1) Bank Size Position */
#define HEMC_CR_NCS1_BANKSIZE_Msk             (_U_(0x1F) << HEMC_CR_NCS1_BANKSIZE_Pos)             /**< (HEMC_CR_NCS1) Bank Size Mask */
#define HEMC_CR_NCS1_BANKSIZE(value)          (HEMC_CR_NCS1_BANKSIZE_Msk & ((value) << HEMC_CR_NCS1_BANKSIZE_Pos))
#define   HEMC_CR_NCS1_BANKSIZE_8KB_Val       _U_(0x0)                                             /**< (HEMC_CR_NCS1) 8Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_16KB_Val      _U_(0x1)                                             /**< (HEMC_CR_NCS1) 16Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_32KB_Val      _U_(0x2)                                             /**< (HEMC_CR_NCS1) 32Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_64KB_Val      _U_(0x3)                                             /**< (HEMC_CR_NCS1) 64Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_128KB_Val     _U_(0x4)                                             /**< (HEMC_CR_NCS1) 128Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_256KB_Val     _U_(0x5)                                             /**< (HEMC_CR_NCS1) 256Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_512KB_Val     _U_(0x6)                                             /**< (HEMC_CR_NCS1) 512Kbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_1MB_Val       _U_(0x7)                                             /**< (HEMC_CR_NCS1) 1Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_2MB_Val       _U_(0x8)                                             /**< (HEMC_CR_NCS1) 2Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_4MB_Val       _U_(0x9)                                             /**< (HEMC_CR_NCS1) 4Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_8MB_Val       _U_(0xA)                                             /**< (HEMC_CR_NCS1) 8Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_16MB_Val      _U_(0xB)                                             /**< (HEMC_CR_NCS1) 16Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_32MB_Val      _U_(0xC)                                             /**< (HEMC_CR_NCS1) 32Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_64MB_Val      _U_(0xD)                                             /**< (HEMC_CR_NCS1) 64Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_128MB_Val     _U_(0xE)                                             /**< (HEMC_CR_NCS1) 128Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_256MB_Val     _U_(0xF)                                             /**< (HEMC_CR_NCS1) 256Mbytes (Default)  */
#define   HEMC_CR_NCS1_BANKSIZE_512MB_Val     _U_(0x10)                                            /**< (HEMC_CR_NCS1) 512Mbytes  */
#define   HEMC_CR_NCS1_BANKSIZE_NOT_USED_Val  _U_(0x1F)                                            /**< (HEMC_CR_NCS1) NOT_USED  */
#define HEMC_CR_NCS1_BANKSIZE_8KB             (HEMC_CR_NCS1_BANKSIZE_8KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 8Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_16KB            (HEMC_CR_NCS1_BANKSIZE_16KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 16Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_32KB            (HEMC_CR_NCS1_BANKSIZE_32KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 32Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_64KB            (HEMC_CR_NCS1_BANKSIZE_64KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 64Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_128KB           (HEMC_CR_NCS1_BANKSIZE_128KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 128Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_256KB           (HEMC_CR_NCS1_BANKSIZE_256KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 256Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_512KB           (HEMC_CR_NCS1_BANKSIZE_512KB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 512Kbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_1MB             (HEMC_CR_NCS1_BANKSIZE_1MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 1Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_2MB             (HEMC_CR_NCS1_BANKSIZE_2MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 2Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_4MB             (HEMC_CR_NCS1_BANKSIZE_4MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 4Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_8MB             (HEMC_CR_NCS1_BANKSIZE_8MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 8Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_16MB            (HEMC_CR_NCS1_BANKSIZE_16MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 16Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_32MB            (HEMC_CR_NCS1_BANKSIZE_32MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 32Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_64MB            (HEMC_CR_NCS1_BANKSIZE_64MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 64Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_128MB           (HEMC_CR_NCS1_BANKSIZE_128MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 128Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_256MB           (HEMC_CR_NCS1_BANKSIZE_256MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 256Mbytes (Default) Position  */
#define HEMC_CR_NCS1_BANKSIZE_512MB           (HEMC_CR_NCS1_BANKSIZE_512MB_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) 512Mbytes Position  */
#define HEMC_CR_NCS1_BANKSIZE_NOT_USED        (HEMC_CR_NCS1_BANKSIZE_NOT_USED_Val << HEMC_CR_NCS1_BANKSIZE_Pos) /**< (HEMC_CR_NCS1) NOT_USED Position  */
#define HEMC_CR_NCS1_TYPE_Pos                 _U_(6)                                               /**< (HEMC_CR_NCS1) type of memory used Position */
#define HEMC_CR_NCS1_TYPE_Msk                 (_U_(0x1) << HEMC_CR_NCS1_TYPE_Pos)                  /**< (HEMC_CR_NCS1) type of memory used Mask */
#define HEMC_CR_NCS1_TYPE(value)              (HEMC_CR_NCS1_TYPE_Msk & ((value) << HEMC_CR_NCS1_TYPE_Pos))
#define HEMC_CR_NCS1_ADDBASE_Pos              _U_(7)                                               /**< (HEMC_CR_NCS1) relative base address of NCS area Position */
#define HEMC_CR_NCS1_ADDBASE_Msk              (_U_(0x3FFFF) << HEMC_CR_NCS1_ADDBASE_Pos)           /**< (HEMC_CR_NCS1) relative base address of NCS area Mask */
#define HEMC_CR_NCS1_ADDBASE(value)           (HEMC_CR_NCS1_ADDBASE_Msk & ((value) << HEMC_CR_NCS1_ADDBASE_Pos))
#define HEMC_CR_NCS1_ECC_ENABLE_Pos           _U_(30)                                              /**< (HEMC_CR_NCS1) ECC Protection Enable Position */
#define HEMC_CR_NCS1_ECC_ENABLE_Msk           (_U_(0x1) << HEMC_CR_NCS1_ECC_ENABLE_Pos)            /**< (HEMC_CR_NCS1) ECC Protection Enable Mask */
#define HEMC_CR_NCS1_ECC_ENABLE(value)        (HEMC_CR_NCS1_ECC_ENABLE_Msk & ((value) << HEMC_CR_NCS1_ECC_ENABLE_Pos))
#define HEMC_CR_NCS1_ECC12_ENABLE_Pos         _U_(31)                                              /**< (HEMC_CR_NCS1) BCH ECC Enable Position */
#define HEMC_CR_NCS1_ECC12_ENABLE_Msk         (_U_(0x1) << HEMC_CR_NCS1_ECC12_ENABLE_Pos)          /**< (HEMC_CR_NCS1) BCH ECC Enable Mask */
#define HEMC_CR_NCS1_ECC12_ENABLE(value)      (HEMC_CR_NCS1_ECC12_ENABLE_Msk & ((value) << HEMC_CR_NCS1_ECC12_ENABLE_Pos))
#define HEMC_CR_NCS1_Msk                      _U_(0xC1FFFFFF)                                      /**< (HEMC_CR_NCS1) Register Mask  */


