Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hemc.h
/* -------- HEMC_CR_NCS2 : (HEMC Offset: 0x08) (R/W 32) HEMC Control Register NCS 2 -------- */
#define HEMC_CR_NCS2_ZERO_Pos                 _U_(0)                                               /**< (HEMC_CR_NCS2) fixed to 0 Position */
#define HEMC_CR_NCS2_ZERO_Msk                 (_U_(0x1) << HEMC_CR_NCS2_ZERO_Pos)                  /**< (HEMC_CR_NCS2) fixed to 0 Mask */
#define HEMC_CR_NCS2_ZERO(value)              (HEMC_CR_NCS2_ZERO_Msk & ((value) << HEMC_CR_NCS2_ZERO_Pos))
#define HEMC_CR_NCS2_BANKSIZE_Pos             _U_(1)                                               /**< (HEMC_CR_NCS2) Bank Size Position */
#define HEMC_CR_NCS2_BANKSIZE_Msk             (_U_(0x1F) << HEMC_CR_NCS2_BANKSIZE_Pos)             /**< (HEMC_CR_NCS2) Bank Size Mask */
#define HEMC_CR_NCS2_BANKSIZE(value)          (HEMC_CR_NCS2_BANKSIZE_Msk & ((value) << HEMC_CR_NCS2_BANKSIZE_Pos))
#define   HEMC_CR_NCS2_BANKSIZE_8KB_Val       _U_(0x0)                                             /**< (HEMC_CR_NCS2) 8Kbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_16KB_Val      _U_(0x1)                                             /**< (HEMC_CR_NCS2) 16Kbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_32KB_Val      _U_(0x2)                                             /**< (HEMC_CR_NCS2) 32Kbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_64KB_Val      _U_(0x3)                                             /**< (HEMC_CR_NCS2) 64Kbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_128KB_Val     _U_(0x4)                                             /**< (HEMC_CR_NCS2) 128Kbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_256KB_Val     _U_(0x5)                                             /**< (HEMC_CR_NCS2) 256Kbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_512KB_Val     _U_(0x6)                                             /**< (HEMC_CR_NCS2) 512Kbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_1MB_Val       _U_(0x7)                                             /**< (HEMC_CR_NCS2) 1Mbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_2MB_Val       _U_(0x8)                                             /**< (HEMC_CR_NCS2) 2Mbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_4MB_Val       _U_(0x9)                                             /**< (HEMC_CR_NCS2) 4Mbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_8MB_Val       _U_(0xA)                                             /**< (HEMC_CR_NCS2) 8Mbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_16MB_Val      _U_(0xB)                                             /**< (HEMC_CR_NCS2) 16Mbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_32MB_Val      _U_(0xC)                                             /**< (HEMC_CR_NCS2) 32Mbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_64MB_Val      _U_(0xD)                                             /**< (HEMC_CR_NCS2) 64Mbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_128MB_Val     _U_(0xE)                                             /**< (HEMC_CR_NCS2) 128Mbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_256MB_Val     _U_(0xF)                                             /**< (HEMC_CR_NCS2) 256Mbytes (Default)  */
#define   HEMC_CR_NCS2_BANKSIZE_512MB_Val     _U_(0x10)                                            /**< (HEMC_CR_NCS2) 512Mbytes  */
#define   HEMC_CR_NCS2_BANKSIZE_NOT_USED_Val  _U_(0x1F)                                            /**< (HEMC_CR_NCS2) NOT_USED  */
#define HEMC_CR_NCS2_BANKSIZE_8KB             (HEMC_CR_NCS2_BANKSIZE_8KB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 8Kbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_16KB            (HEMC_CR_NCS2_BANKSIZE_16KB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 16Kbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_32KB            (HEMC_CR_NCS2_BANKSIZE_32KB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 32Kbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_64KB            (HEMC_CR_NCS2_BANKSIZE_64KB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 64Kbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_128KB           (HEMC_CR_NCS2_BANKSIZE_128KB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 128Kbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_256KB           (HEMC_CR_NCS2_BANKSIZE_256KB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 256Kbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_512KB           (HEMC_CR_NCS2_BANKSIZE_512KB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 512Kbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_1MB             (HEMC_CR_NCS2_BANKSIZE_1MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 1Mbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_2MB             (HEMC_CR_NCS2_BANKSIZE_2MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 2Mbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_4MB             (HEMC_CR_NCS2_BANKSIZE_4MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 4Mbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_8MB             (HEMC_CR_NCS2_BANKSIZE_8MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 8Mbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_16MB            (HEMC_CR_NCS2_BANKSIZE_16MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 16Mbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_32MB            (HEMC_CR_NCS2_BANKSIZE_32MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 32Mbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_64MB            (HEMC_CR_NCS2_BANKSIZE_64MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 64Mbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_128MB           (HEMC_CR_NCS2_BANKSIZE_128MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 128Mbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_256MB           (HEMC_CR_NCS2_BANKSIZE_256MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 256Mbytes (Default) Position  */
#define HEMC_CR_NCS2_BANKSIZE_512MB           (HEMC_CR_NCS2_BANKSIZE_512MB_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) 512Mbytes Position  */
#define HEMC_CR_NCS2_BANKSIZE_NOT_USED        (HEMC_CR_NCS2_BANKSIZE_NOT_USED_Val << HEMC_CR_NCS2_BANKSIZE_Pos) /**< (HEMC_CR_NCS2) NOT_USED Position  */
#define HEMC_CR_NCS2_TYPE_Pos                 _U_(6)                                               /**< (HEMC_CR_NCS2) type of memory used Position */
#define HEMC_CR_NCS2_TYPE_Msk                 (_U_(0x1) << HEMC_CR_NCS2_TYPE_Pos)                  /**< (HEMC_CR_NCS2) type of memory used Mask */
#define HEMC_CR_NCS2_TYPE(value)              (HEMC_CR_NCS2_TYPE_Msk & ((value) << HEMC_CR_NCS2_TYPE_Pos))
#define HEMC_CR_NCS2_ADDBASE_Pos              _U_(7)                                               /**< (HEMC_CR_NCS2) relative base address of NCS area Position */
#define HEMC_CR_NCS2_ADDBASE_Msk              (_U_(0x3FFFF) << HEMC_CR_NCS2_ADDBASE_Pos)           /**< (HEMC_CR_NCS2) relative base address of NCS area Mask */
#define HEMC_CR_NCS2_ADDBASE(value)           (HEMC_CR_NCS2_ADDBASE_Msk & ((value) << HEMC_CR_NCS2_ADDBASE_Pos))
#define HEMC_CR_NCS2_ECC_ENABLE_Pos           _U_(30)                                              /**< (HEMC_CR_NCS2) ECC Protection Enable Position */
#define HEMC_CR_NCS2_ECC_ENABLE_Msk           (_U_(0x1) << HEMC_CR_NCS2_ECC_ENABLE_Pos)            /**< (HEMC_CR_NCS2) ECC Protection Enable Mask */
#define HEMC_CR_NCS2_ECC_ENABLE(value)        (HEMC_CR_NCS2_ECC_ENABLE_Msk & ((value) << HEMC_CR_NCS2_ECC_ENABLE_Pos))
#define HEMC_CR_NCS2_ECC12_ENABLE_Pos         _U_(31)                                              /**< (HEMC_CR_NCS2) BCH ECC Enable Position */
#define HEMC_CR_NCS2_ECC12_ENABLE_Msk         (_U_(0x1) << HEMC_CR_NCS2_ECC12_ENABLE_Pos)          /**< (HEMC_CR_NCS2) BCH ECC Enable Mask */
#define HEMC_CR_NCS2_ECC12_ENABLE(value)      (HEMC_CR_NCS2_ECC12_ENABLE_Msk & ((value) << HEMC_CR_NCS2_ECC12_ENABLE_Pos))
#define HEMC_CR_NCS2_Msk                      _U_(0xC1FFFFFF)                                      /**< (HEMC_CR_NCS2) Register Mask  */


