Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hemc.h
/* -------- HEMC_CTRL : (HEMC Offset: 0x18) (R/W 32) HEMC Polarity Control register -------- */
#define HEMC_CTRL_POL_Pos                     _U_(0)                                               /**< (HEMC_CTRL) External control buffer active polarity Position */
#define HEMC_CTRL_POL_Msk                     (_U_(0x1) << HEMC_CTRL_POL_Pos)                      /**< (HEMC_CTRL) External control buffer active polarity Mask */
#define HEMC_CTRL_POL(value)                  (HEMC_CTRL_POL_Msk & ((value) << HEMC_CTRL_POL_Pos))
#define HEMC_CTRL_Msk                         _U_(0x00000001)                                      /**< (HEMC_CTRL) Register Mask  */


/* -------- HEMC_CRP_NCS0 : (HEMC Offset: 0x20) (R/W 32) HEMC Control Register Protection NCS 0 -------- */
#define HEMC_CRP_NCS0_MASTERNUMBER_Pos        _U_(0)                                               /**< (HEMC_CRP_NCS0) Master Number ID Position */
#define HEMC_CRP_NCS0_MASTERNUMBER_Msk        (_U_(0xFFFF) << HEMC_CRP_NCS0_MASTERNUMBER_Pos)      /**< (HEMC_CRP_NCS0) Master Number ID Mask */
#define HEMC_CRP_NCS0_MASTERNUMBER(value)     (HEMC_CRP_NCS0_MASTERNUMBER_Msk & ((value) << HEMC_CRP_NCS0_MASTERNUMBER_Pos))
#define HEMC_CRP_NCS0_SUPERUSER_Pos           _U_(16)                                              /**< (HEMC_CRP_NCS0) User or Superuser access Position */
#define HEMC_CRP_NCS0_SUPERUSER_Msk           (_U_(0x1) << HEMC_CRP_NCS0_SUPERUSER_Pos)            /**< (HEMC_CRP_NCS0) User or Superuser access Mask */
#define HEMC_CRP_NCS0_SUPERUSER(value)        (HEMC_CRP_NCS0_SUPERUSER_Msk & ((value) << HEMC_CRP_NCS0_SUPERUSER_Pos))
#define HEMC_CRP_NCS0_WR_Pos                  _U_(17)                                              /**< (HEMC_CRP_NCS0) Write Access Position */
#define HEMC_CRP_NCS0_WR_Msk                  (_U_(0x1) << HEMC_CRP_NCS0_WR_Pos)                   /**< (HEMC_CRP_NCS0) Write Access Mask */
#define HEMC_CRP_NCS0_WR(value)               (HEMC_CRP_NCS0_WR_Msk & ((value) << HEMC_CRP_NCS0_WR_Pos))
#define HEMC_CRP_NCS0_RD_Pos                  _U_(18)                                              /**< (HEMC_CRP_NCS0) Read Access Position */
#define HEMC_CRP_NCS0_RD_Msk                  (_U_(0x1) << HEMC_CRP_NCS0_RD_Pos)                   /**< (HEMC_CRP_NCS0) Read Access Mask */
#define HEMC_CRP_NCS0_RD(value)               (HEMC_CRP_NCS0_RD_Msk & ((value) << HEMC_CRP_NCS0_RD_Pos))
#define HEMC_CRP_NCS0_SPLITBANKSIZE_Pos       _U_(19)                                              /**< (HEMC_CRP_NCS0) bank size internal separation Position */
#define HEMC_CRP_NCS0_SPLITBANKSIZE_Msk       (_U_(0x1F) << HEMC_CRP_NCS0_SPLITBANKSIZE_Pos)       /**< (HEMC_CRP_NCS0) bank size internal separation Mask */
#define HEMC_CRP_NCS0_SPLITBANKSIZE(value)    (HEMC_CRP_NCS0_SPLITBANKSIZE_Msk & ((value) << HEMC_CRP_NCS0_SPLITBANKSIZE_Pos))
#define HEMC_CRP_NCS0_PROTECTZONE_Pos         _U_(24)                                              /**< (HEMC_CRP_NCS0) select area protected Position */
#define HEMC_CRP_NCS0_PROTECTZONE_Msk         (_U_(0x1) << HEMC_CRP_NCS0_PROTECTZONE_Pos)          /**< (HEMC_CRP_NCS0) select area protected Mask */
#define HEMC_CRP_NCS0_PROTECTZONE(value)      (HEMC_CRP_NCS0_PROTECTZONE_Msk & ((value) << HEMC_CRP_NCS0_PROTECTZONE_Pos))
#define HEMC_CRP_NCS0_PROTECTON_Pos           _U_(25)                                              /**< (HEMC_CRP_NCS0) protection activation Position */
#define HEMC_CRP_NCS0_PROTECTON_Msk           (_U_(0x1) << HEMC_CRP_NCS0_PROTECTON_Pos)            /**< (HEMC_CRP_NCS0) protection activation Mask */
#define HEMC_CRP_NCS0_PROTECTON(value)        (HEMC_CRP_NCS0_PROTECTON_Msk & ((value) << HEMC_CRP_NCS0_PROTECTON_Pos))
#define HEMC_CRP_NCS0_Msk                     _U_(0x03FFFFFF)                                      /**< (HEMC_CRP_NCS0) Register Mask  */


/* -------- HEMC_CRP_NCS1 : (HEMC Offset: 0x24) (R/W 32) HEMC Control Register Protection NCS 1 -------- */
#define HEMC_CRP_NCS1_MASTERNUMBER_Pos        _U_(0)                                               /**< (HEMC_CRP_NCS1) Master Number ID Position */
#define HEMC_CRP_NCS1_MASTERNUMBER_Msk        (_U_(0xFFFF) << HEMC_CRP_NCS1_MASTERNUMBER_Pos)      /**< (HEMC_CRP_NCS1) Master Number ID Mask */
#define HEMC_CRP_NCS1_MASTERNUMBER(value)     (HEMC_CRP_NCS1_MASTERNUMBER_Msk & ((value) << HEMC_CRP_NCS1_MASTERNUMBER_Pos))
#define HEMC_CRP_NCS1_SUPERUSER_Pos           _U_(16)                                              /**< (HEMC_CRP_NCS1) User or Superuser access Position */
#define HEMC_CRP_NCS1_SUPERUSER_Msk           (_U_(0x1) << HEMC_CRP_NCS1_SUPERUSER_Pos)            /**< (HEMC_CRP_NCS1) User or Superuser access Mask */
#define HEMC_CRP_NCS1_SUPERUSER(value)        (HEMC_CRP_NCS1_SUPERUSER_Msk & ((value) << HEMC_CRP_NCS1_SUPERUSER_Pos))
#define HEMC_CRP_NCS1_WR_Pos                  _U_(17)                                              /**< (HEMC_CRP_NCS1) Write Access Position */
#define HEMC_CRP_NCS1_WR_Msk                  (_U_(0x1) << HEMC_CRP_NCS1_WR_Pos)                   /**< (HEMC_CRP_NCS1) Write Access Mask */
#define HEMC_CRP_NCS1_WR(value)               (HEMC_CRP_NCS1_WR_Msk & ((value) << HEMC_CRP_NCS1_WR_Pos))
#define HEMC_CRP_NCS1_RD_Pos                  _U_(18)                                              /**< (HEMC_CRP_NCS1) Read Access Position */
#define HEMC_CRP_NCS1_RD_Msk                  (_U_(0x1) << HEMC_CRP_NCS1_RD_Pos)                   /**< (HEMC_CRP_NCS1) Read Access Mask */
#define HEMC_CRP_NCS1_RD(value)               (HEMC_CRP_NCS1_RD_Msk & ((value) << HEMC_CRP_NCS1_RD_Pos))
#define HEMC_CRP_NCS1_SPLITBANKSIZE_Pos       _U_(19)                                              /**< (HEMC_CRP_NCS1) bank size internal separation Position */
#define HEMC_CRP_NCS1_SPLITBANKSIZE_Msk       (_U_(0x1F) << HEMC_CRP_NCS1_SPLITBANKSIZE_Pos)       /**< (HEMC_CRP_NCS1) bank size internal separation Mask */
#define HEMC_CRP_NCS1_SPLITBANKSIZE(value)    (HEMC_CRP_NCS1_SPLITBANKSIZE_Msk & ((value) << HEMC_CRP_NCS1_SPLITBANKSIZE_Pos))
#define HEMC_CRP_NCS1_PROTECTZONE_Pos         _U_(24)                                              /**< (HEMC_CRP_NCS1) select area protected Position */
#define HEMC_CRP_NCS1_PROTECTZONE_Msk         (_U_(0x1) << HEMC_CRP_NCS1_PROTECTZONE_Pos)          /**< (HEMC_CRP_NCS1) select area protected Mask */
#define HEMC_CRP_NCS1_PROTECTZONE(value)      (HEMC_CRP_NCS1_PROTECTZONE_Msk & ((value) << HEMC_CRP_NCS1_PROTECTZONE_Pos))
#define HEMC_CRP_NCS1_PROTECTON_Pos           _U_(25)                                              /**< (HEMC_CRP_NCS1) protection activation Position */
#define HEMC_CRP_NCS1_PROTECTON_Msk           (_U_(0x1) << HEMC_CRP_NCS1_PROTECTON_Pos)            /**< (HEMC_CRP_NCS1) protection activation Mask */
#define HEMC_CRP_NCS1_PROTECTON(value)        (HEMC_CRP_NCS1_PROTECTON_Msk & ((value) << HEMC_CRP_NCS1_PROTECTON_Pos))
#define HEMC_CRP_NCS1_Msk                     _U_(0x03FFFFFF)                                      /**< (HEMC_CRP_NCS1) Register Mask  */


/* -------- HEMC_CRP_NCS2 : (HEMC Offset: 0x28) (R/W 32) HEMC Control Register Protection NCS 2 -------- */
#define HEMC_CRP_NCS2_MASTERNUMBER_Pos        _U_(0)                                               /**< (HEMC_CRP_NCS2) Master Number ID Position */
#define HEMC_CRP_NCS2_MASTERNUMBER_Msk        (_U_(0xFFFF) << HEMC_CRP_NCS2_MASTERNUMBER_Pos)      /**< (HEMC_CRP_NCS2) Master Number ID Mask */
#define HEMC_CRP_NCS2_MASTERNUMBER(value)     (HEMC_CRP_NCS2_MASTERNUMBER_Msk & ((value) << HEMC_CRP_NCS2_MASTERNUMBER_Pos))
#define HEMC_CRP_NCS2_SUPERUSER_Pos           _U_(16)                                              /**< (HEMC_CRP_NCS2) User or Superuser access Position */
#define HEMC_CRP_NCS2_SUPERUSER_Msk           (_U_(0x1) << HEMC_CRP_NCS2_SUPERUSER_Pos)            /**< (HEMC_CRP_NCS2) User or Superuser access Mask */
#define HEMC_CRP_NCS2_SUPERUSER(value)        (HEMC_CRP_NCS2_SUPERUSER_Msk & ((value) << HEMC_CRP_NCS2_SUPERUSER_Pos))
#define HEMC_CRP_NCS2_WR_Pos                  _U_(17)                                              /**< (HEMC_CRP_NCS2) Write Access Position */
#define HEMC_CRP_NCS2_WR_Msk                  (_U_(0x1) << HEMC_CRP_NCS2_WR_Pos)                   /**< (HEMC_CRP_NCS2) Write Access Mask */
#define HEMC_CRP_NCS2_WR(value)               (HEMC_CRP_NCS2_WR_Msk & ((value) << HEMC_CRP_NCS2_WR_Pos))
#define HEMC_CRP_NCS2_RD_Pos                  _U_(18)                                              /**< (HEMC_CRP_NCS2) Read Access Position */
#define HEMC_CRP_NCS2_RD_Msk                  (_U_(0x1) << HEMC_CRP_NCS2_RD_Pos)                   /**< (HEMC_CRP_NCS2) Read Access Mask */
#define HEMC_CRP_NCS2_RD(value)               (HEMC_CRP_NCS2_RD_Msk & ((value) << HEMC_CRP_NCS2_RD_Pos))
#define HEMC_CRP_NCS2_SPLITBANKSIZE_Pos       _U_(19)                                              /**< (HEMC_CRP_NCS2) bank size internal separation Position */
#define HEMC_CRP_NCS2_SPLITBANKSIZE_Msk       (_U_(0x1F) << HEMC_CRP_NCS2_SPLITBANKSIZE_Pos)       /**< (HEMC_CRP_NCS2) bank size internal separation Mask */
#define HEMC_CRP_NCS2_SPLITBANKSIZE(value)    (HEMC_CRP_NCS2_SPLITBANKSIZE_Msk & ((value) << HEMC_CRP_NCS2_SPLITBANKSIZE_Pos))
#define HEMC_CRP_NCS2_PROTECTZONE_Pos         _U_(24)                                              /**< (HEMC_CRP_NCS2) select area protected Position */
#define HEMC_CRP_NCS2_PROTECTZONE_Msk         (_U_(0x1) << HEMC_CRP_NCS2_PROTECTZONE_Pos)          /**< (HEMC_CRP_NCS2) select area protected Mask */
#define HEMC_CRP_NCS2_PROTECTZONE(value)      (HEMC_CRP_NCS2_PROTECTZONE_Msk & ((value) << HEMC_CRP_NCS2_PROTECTZONE_Pos))
#define HEMC_CRP_NCS2_PROTECTON_Pos           _U_(25)                                              /**< (HEMC_CRP_NCS2) protection activation Position */
#define HEMC_CRP_NCS2_PROTECTON_Msk           (_U_(0x1) << HEMC_CRP_NCS2_PROTECTON_Pos)            /**< (HEMC_CRP_NCS2) protection activation Mask */
#define HEMC_CRP_NCS2_PROTECTON(value)        (HEMC_CRP_NCS2_PROTECTON_Msk & ((value) << HEMC_CRP_NCS2_PROTECTON_Pos))
#define HEMC_CRP_NCS2_Msk                     _U_(0x03FFFFFF)                                      /**< (HEMC_CRP_NCS2) Register Mask  */


/* -------- HEMC_CRP_NCS3 : (HEMC Offset: 0x2C) (R/W 32) HEMC Control Register Protection NCS 3 -------- */
#define HEMC_CRP_NCS3_MASTERNUMBER_Pos        _U_(0)                                               /**< (HEMC_CRP_NCS3) Master Number ID Position */
#define HEMC_CRP_NCS3_MASTERNUMBER_Msk        (_U_(0xFFFF) << HEMC_CRP_NCS3_MASTERNUMBER_Pos)      /**< (HEMC_CRP_NCS3) Master Number ID Mask */
#define HEMC_CRP_NCS3_MASTERNUMBER(value)     (HEMC_CRP_NCS3_MASTERNUMBER_Msk & ((value) << HEMC_CRP_NCS3_MASTERNUMBER_Pos))
#define HEMC_CRP_NCS3_SUPERUSER_Pos           _U_(16)                                              /**< (HEMC_CRP_NCS3) User or Superuser access Position */
#define HEMC_CRP_NCS3_SUPERUSER_Msk           (_U_(0x1) << HEMC_CRP_NCS3_SUPERUSER_Pos)            /**< (HEMC_CRP_NCS3) User or Superuser access Mask */
#define HEMC_CRP_NCS3_SUPERUSER(value)        (HEMC_CRP_NCS3_SUPERUSER_Msk & ((value) << HEMC_CRP_NCS3_SUPERUSER_Pos))
#define HEMC_CRP_NCS3_WR_Pos                  _U_(17)                                              /**< (HEMC_CRP_NCS3) Write Access Position */
#define HEMC_CRP_NCS3_WR_Msk                  (_U_(0x1) << HEMC_CRP_NCS3_WR_Pos)                   /**< (HEMC_CRP_NCS3) Write Access Mask */
#define HEMC_CRP_NCS3_WR(value)               (HEMC_CRP_NCS3_WR_Msk & ((value) << HEMC_CRP_NCS3_WR_Pos))
#define HEMC_CRP_NCS3_RD_Pos                  _U_(18)                                              /**< (HEMC_CRP_NCS3) Read Access Position */
#define HEMC_CRP_NCS3_RD_Msk                  (_U_(0x1) << HEMC_CRP_NCS3_RD_Pos)                   /**< (HEMC_CRP_NCS3) Read Access Mask */
#define HEMC_CRP_NCS3_RD(value)               (HEMC_CRP_NCS3_RD_Msk & ((value) << HEMC_CRP_NCS3_RD_Pos))
#define HEMC_CRP_NCS3_SPLITBANKSIZE_Pos       _U_(19)                                              /**< (HEMC_CRP_NCS3) bank size internal separation Position */
#define HEMC_CRP_NCS3_SPLITBANKSIZE_Msk       (_U_(0x1F) << HEMC_CRP_NCS3_SPLITBANKSIZE_Pos)       /**< (HEMC_CRP_NCS3) bank size internal separation Mask */
#define HEMC_CRP_NCS3_SPLITBANKSIZE(value)    (HEMC_CRP_NCS3_SPLITBANKSIZE_Msk & ((value) << HEMC_CRP_NCS3_SPLITBANKSIZE_Pos))
#define HEMC_CRP_NCS3_PROTECTZONE_Pos         _U_(24)                                              /**< (HEMC_CRP_NCS3) select area protected Position */
#define HEMC_CRP_NCS3_PROTECTZONE_Msk         (_U_(0x1) << HEMC_CRP_NCS3_PROTECTZONE_Pos)          /**< (HEMC_CRP_NCS3) select area protected Mask */
#define HEMC_CRP_NCS3_PROTECTZONE(value)      (HEMC_CRP_NCS3_PROTECTZONE_Msk & ((value) << HEMC_CRP_NCS3_PROTECTZONE_Pos))
#define HEMC_CRP_NCS3_PROTECTON_Pos           _U_(25)                                              /**< (HEMC_CRP_NCS3) protection activation Position */
#define HEMC_CRP_NCS3_PROTECTON_Msk           (_U_(0x1) << HEMC_CRP_NCS3_PROTECTON_Pos)            /**< (HEMC_CRP_NCS3) protection activation Mask */
#define HEMC_CRP_NCS3_PROTECTON(value)        (HEMC_CRP_NCS3_PROTECTON_Msk & ((value) << HEMC_CRP_NCS3_PROTECTON_Pos))
#define HEMC_CRP_NCS3_Msk                     _U_(0x03FFFFFF)                                      /**< (HEMC_CRP_NCS3) Register Mask  */


/* -------- HEMC_CRP_NCS4 : (HEMC Offset: 0x30) (R/W 32) HEMC Control Register Protection NCS 4 -------- */
#define HEMC_CRP_NCS4_MASTERNUMBER_Pos        _U_(0)                                               /**< (HEMC_CRP_NCS4) Master Number ID Position */
#define HEMC_CRP_NCS4_MASTERNUMBER_Msk        (_U_(0xFFFF) << HEMC_CRP_NCS4_MASTERNUMBER_Pos)      /**< (HEMC_CRP_NCS4) Master Number ID Mask */
#define HEMC_CRP_NCS4_MASTERNUMBER(value)     (HEMC_CRP_NCS4_MASTERNUMBER_Msk & ((value) << HEMC_CRP_NCS4_MASTERNUMBER_Pos))
#define HEMC_CRP_NCS4_SUPERUSER_Pos           _U_(16)                                              /**< (HEMC_CRP_NCS4) User or Superuser access Position */
#define HEMC_CRP_NCS4_SUPERUSER_Msk           (_U_(0x1) << HEMC_CRP_NCS4_SUPERUSER_Pos)            /**< (HEMC_CRP_NCS4) User or Superuser access Mask */
#define HEMC_CRP_NCS4_SUPERUSER(value)        (HEMC_CRP_NCS4_SUPERUSER_Msk & ((value) << HEMC_CRP_NCS4_SUPERUSER_Pos))
#define HEMC_CRP_NCS4_WR_Pos                  _U_(17)                                              /**< (HEMC_CRP_NCS4) Write Access Position */
#define HEMC_CRP_NCS4_WR_Msk                  (_U_(0x1) << HEMC_CRP_NCS4_WR_Pos)                   /**< (HEMC_CRP_NCS4) Write Access Mask */
#define HEMC_CRP_NCS4_WR(value)               (HEMC_CRP_NCS4_WR_Msk & ((value) << HEMC_CRP_NCS4_WR_Pos))
#define HEMC_CRP_NCS4_RD_Pos                  _U_(18)                                              /**< (HEMC_CRP_NCS4) Read Access Position */
#define HEMC_CRP_NCS4_RD_Msk                  (_U_(0x1) << HEMC_CRP_NCS4_RD_Pos)                   /**< (HEMC_CRP_NCS4) Read Access Mask */
#define HEMC_CRP_NCS4_RD(value)               (HEMC_CRP_NCS4_RD_Msk & ((value) << HEMC_CRP_NCS4_RD_Pos))
#define HEMC_CRP_NCS4_SPLITBANKSIZE_Pos       _U_(19)                                              /**< (HEMC_CRP_NCS4) bank size internal separation Position */
#define HEMC_CRP_NCS4_SPLITBANKSIZE_Msk       (_U_(0x1F) << HEMC_CRP_NCS4_SPLITBANKSIZE_Pos)       /**< (HEMC_CRP_NCS4) bank size internal separation Mask */
#define HEMC_CRP_NCS4_SPLITBANKSIZE(value)    (HEMC_CRP_NCS4_SPLITBANKSIZE_Msk & ((value) << HEMC_CRP_NCS4_SPLITBANKSIZE_Pos))
#define HEMC_CRP_NCS4_PROTECTZONE_Pos         _U_(24)                                              /**< (HEMC_CRP_NCS4) select area protected Position */
#define HEMC_CRP_NCS4_PROTECTZONE_Msk         (_U_(0x1) << HEMC_CRP_NCS4_PROTECTZONE_Pos)          /**< (HEMC_CRP_NCS4) select area protected Mask */
#define HEMC_CRP_NCS4_PROTECTZONE(value)      (HEMC_CRP_NCS4_PROTECTZONE_Msk & ((value) << HEMC_CRP_NCS4_PROTECTZONE_Pos))
#define HEMC_CRP_NCS4_PROTECTON_Pos           _U_(25)                                              /**< (HEMC_CRP_NCS4) protection activation Position */
#define HEMC_CRP_NCS4_PROTECTON_Msk           (_U_(0x1) << HEMC_CRP_NCS4_PROTECTON_Pos)            /**< (HEMC_CRP_NCS4) protection activation Mask */
#define HEMC_CRP_NCS4_PROTECTON(value)        (HEMC_CRP_NCS4_PROTECTON_Msk & ((value) << HEMC_CRP_NCS4_PROTECTON_Pos))
#define HEMC_CRP_NCS4_Msk                     _U_(0x03FFFFFF)                                      /**< (HEMC_CRP_NCS4) Register Mask  */


/* -------- HEMC_CRP_NCS5 : (HEMC Offset: 0x34) (R/W 32) HEMC Control Register Protection NCS 5 -------- */
#define HEMC_CRP_NCS5_MASTERNUMBER_Pos        _U_(0)                                               /**< (HEMC_CRP_NCS5) Master Number ID Position */
#define HEMC_CRP_NCS5_MASTERNUMBER_Msk        (_U_(0xFFFF) << HEMC_CRP_NCS5_MASTERNUMBER_Pos)      /**< (HEMC_CRP_NCS5) Master Number ID Mask */
#define HEMC_CRP_NCS5_MASTERNUMBER(value)     (HEMC_CRP_NCS5_MASTERNUMBER_Msk & ((value) << HEMC_CRP_NCS5_MASTERNUMBER_Pos))
#define HEMC_CRP_NCS5_SUPERUSER_Pos           _U_(16)                                              /**< (HEMC_CRP_NCS5) User or Superuser access Position */
#define HEMC_CRP_NCS5_SUPERUSER_Msk           (_U_(0x1) << HEMC_CRP_NCS5_SUPERUSER_Pos)            /**< (HEMC_CRP_NCS5) User or Superuser access Mask */
#define HEMC_CRP_NCS5_SUPERUSER(value)        (HEMC_CRP_NCS5_SUPERUSER_Msk & ((value) << HEMC_CRP_NCS5_SUPERUSER_Pos))
#define HEMC_CRP_NCS5_WR_Pos                  _U_(17)                                              /**< (HEMC_CRP_NCS5) Write Access Position */
#define HEMC_CRP_NCS5_WR_Msk                  (_U_(0x1) << HEMC_CRP_NCS5_WR_Pos)                   /**< (HEMC_CRP_NCS5) Write Access Mask */
#define HEMC_CRP_NCS5_WR(value)               (HEMC_CRP_NCS5_WR_Msk & ((value) << HEMC_CRP_NCS5_WR_Pos))
#define HEMC_CRP_NCS5_RD_Pos                  _U_(18)                                              /**< (HEMC_CRP_NCS5) Read Access Position */
#define HEMC_CRP_NCS5_RD_Msk                  (_U_(0x1) << HEMC_CRP_NCS5_RD_Pos)                   /**< (HEMC_CRP_NCS5) Read Access Mask */
#define HEMC_CRP_NCS5_RD(value)               (HEMC_CRP_NCS5_RD_Msk & ((value) << HEMC_CRP_NCS5_RD_Pos))
#define HEMC_CRP_NCS5_SPLITBANKSIZE_Pos       _U_(19)                                              /**< (HEMC_CRP_NCS5) bank size internal separation Position */
#define HEMC_CRP_NCS5_SPLITBANKSIZE_Msk       (_U_(0x1F) << HEMC_CRP_NCS5_SPLITBANKSIZE_Pos)       /**< (HEMC_CRP_NCS5) bank size internal separation Mask */
#define HEMC_CRP_NCS5_SPLITBANKSIZE(value)    (HEMC_CRP_NCS5_SPLITBANKSIZE_Msk & ((value) << HEMC_CRP_NCS5_SPLITBANKSIZE_Pos))
#define HEMC_CRP_NCS5_PROTECTZONE_Pos         _U_(24)                                              /**< (HEMC_CRP_NCS5) select area protected Position */
#define HEMC_CRP_NCS5_PROTECTZONE_Msk         (_U_(0x1) << HEMC_CRP_NCS5_PROTECTZONE_Pos)          /**< (HEMC_CRP_NCS5) select area protected Mask */
#define HEMC_CRP_NCS5_PROTECTZONE(value)      (HEMC_CRP_NCS5_PROTECTZONE_Msk & ((value) << HEMC_CRP_NCS5_PROTECTZONE_Pos))
#define HEMC_CRP_NCS5_PROTECTON_Pos           _U_(25)                                              /**< (HEMC_CRP_NCS5) protection activation Position */
#define HEMC_CRP_NCS5_PROTECTON_Msk           (_U_(0x1) << HEMC_CRP_NCS5_PROTECTON_Pos)            /**< (HEMC_CRP_NCS5) protection activation Mask */
#define HEMC_CRP_NCS5_PROTECTON(value)        (HEMC_CRP_NCS5_PROTECTON_Msk & ((value) << HEMC_CRP_NCS5_PROTECTON_Pos))
#define HEMC_CRP_NCS5_Msk                     _U_(0x03FFFFFF)                                      /**< (HEMC_CRP_NCS5) Register Mask  */


/* -------- HEMC_IER : (HEMC Offset: 0x38) ( /W 32) HEMC Interrupt Enable Register -------- */
#define HEMC_IER_OUTOFRANGE_Pos               _U_(1)                                               /**< (HEMC_IER) out of range Position */
#define HEMC_IER_OUTOFRANGE_Msk               (_U_(0x1) << HEMC_IER_OUTOFRANGE_Pos)                /**< (HEMC_IER) out of range Mask */
#define HEMC_IER_OUTOFRANGE(value)            (HEMC_IER_OUTOFRANGE_Msk & ((value) << HEMC_IER_OUTOFRANGE_Pos))
#define HEMC_IER_RDERRORACCESS_Pos            _U_(2)                                               /**< (HEMC_IER) read access error Position */
#define HEMC_IER_RDERRORACCESS_Msk            (_U_(0x1) << HEMC_IER_RDERRORACCESS_Pos)             /**< (HEMC_IER) read access error Mask */
#define HEMC_IER_RDERRORACCESS(value)         (HEMC_IER_RDERRORACCESS_Msk & ((value) << HEMC_IER_RDERRORACCESS_Pos))
#define HEMC_IER_WRERRORACCESS_Pos            _U_(3)                                               /**< (HEMC_IER) write access error Position */
#define HEMC_IER_WRERRORACCESS_Msk            (_U_(0x1) << HEMC_IER_WRERRORACCESS_Pos)             /**< (HEMC_IER) write access error Mask */
#define HEMC_IER_WRERRORACCESS(value)         (HEMC_IER_WRERRORACCESS_Msk & ((value) << HEMC_IER_WRERRORACCESS_Pos))
#define HEMC_IER_USERERRORACCESS_Pos          _U_(4)                                               /**< (HEMC_IER) user or superuser access error Position */
#define HEMC_IER_USERERRORACCESS_Msk          (_U_(0x1) << HEMC_IER_USERERRORACCESS_Pos)           /**< (HEMC_IER) user or superuser access error Mask */
#define HEMC_IER_USERERRORACCESS(value)       (HEMC_IER_USERERRORACCESS_Msk & ((value) << HEMC_IER_USERERRORACCESS_Pos))
#define HEMC_IER_Msk                          _U_(0x0000001E)                                      /**< (HEMC_IER) Register Mask  */


/* -------- HEMC_IDR : (HEMC Offset: 0x3C) ( /W 32) HEMC Interrupt Disable Register -------- */
#define HEMC_IDR_OUTOFRANGE_Pos               _U_(1)                                               /**< (HEMC_IDR) out of range Position */
#define HEMC_IDR_OUTOFRANGE_Msk               (_U_(0x1) << HEMC_IDR_OUTOFRANGE_Pos)                /**< (HEMC_IDR) out of range Mask */
#define HEMC_IDR_OUTOFRANGE(value)            (HEMC_IDR_OUTOFRANGE_Msk & ((value) << HEMC_IDR_OUTOFRANGE_Pos))
#define HEMC_IDR_RDERRORACCESS_Pos            _U_(2)                                               /**< (HEMC_IDR) read access error Position */
#define HEMC_IDR_RDERRORACCESS_Msk            (_U_(0x1) << HEMC_IDR_RDERRORACCESS_Pos)             /**< (HEMC_IDR) read access error Mask */
#define HEMC_IDR_RDERRORACCESS(value)         (HEMC_IDR_RDERRORACCESS_Msk & ((value) << HEMC_IDR_RDERRORACCESS_Pos))
#define HEMC_IDR_WRERRORACCESS_Pos            _U_(3)                                               /**< (HEMC_IDR) write access error Position */
#define HEMC_IDR_WRERRORACCESS_Msk            (_U_(0x1) << HEMC_IDR_WRERRORACCESS_Pos)             /**< (HEMC_IDR) write access error Mask */
#define HEMC_IDR_WRERRORACCESS(value)         (HEMC_IDR_WRERRORACCESS_Msk & ((value) << HEMC_IDR_WRERRORACCESS_Pos))
#define HEMC_IDR_USERERRORACCESS_Pos          _U_(4)                                               /**< (HEMC_IDR) user or superuser access error Position */
#define HEMC_IDR_USERERRORACCESS_Msk          (_U_(0x1) << HEMC_IDR_USERERRORACCESS_Pos)           /**< (HEMC_IDR) user or superuser access error Mask */
#define HEMC_IDR_USERERRORACCESS(value)       (HEMC_IDR_USERERRORACCESS_Msk & ((value) << HEMC_IDR_USERERRORACCESS_Pos))
#define HEMC_IDR_Msk                          _U_(0x0000001E)                                      /**< (HEMC_IDR) Register Mask  */


