Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20B_DFP/component/hemc.h
/* -------- HEMC_HECC_IDR : (HEMC Offset: 0x188) ( /W 32) HECC Interrupt Disable Register -------- */
#define HEMC_HECC_IDR_MEM_FIX_Pos             _U_(0)                                               /**< (HEMC_HECC_IDR) fixable error Position */
#define HEMC_HECC_IDR_MEM_FIX_Msk             (_U_(0x1) << HEMC_HECC_IDR_MEM_FIX_Pos)              /**< (HEMC_HECC_IDR) fixable error Mask */
#define HEMC_HECC_IDR_MEM_FIX(value)          (HEMC_HECC_IDR_MEM_FIX_Msk & ((value) << HEMC_HECC_IDR_MEM_FIX_Pos))
#define HEMC_HECC_IDR_MEM_NOFIX_Pos           _U_(1)                                               /**< (HEMC_HECC_IDR) un-fixable error Position */
#define HEMC_HECC_IDR_MEM_NOFIX_Msk           (_U_(0x1) << HEMC_HECC_IDR_MEM_NOFIX_Pos)            /**< (HEMC_HECC_IDR) un-fixable error Mask */
#define HEMC_HECC_IDR_MEM_NOFIX(value)        (HEMC_HECC_IDR_MEM_NOFIX_Msk & ((value) << HEMC_HECC_IDR_MEM_NOFIX_Pos))
#define HEMC_HECC_IDR_Msk                     _U_(0x00000003)                                      /**< (HEMC_HECC_IDR) Register Mask  */


/* -------- HEMC_HECC_IMR : (HEMC Offset: 0x18C) ( R/ 32) HECC Interrupt Mask Register -------- */
#define HEMC_HECC_IMR_MEM_FIX_Pos             _U_(0)                                               /**< (HEMC_HECC_IMR) fixable error Position */
#define HEMC_HECC_IMR_MEM_FIX_Msk             (_U_(0x1) << HEMC_HECC_IMR_MEM_FIX_Pos)              /**< (HEMC_HECC_IMR) fixable error Mask */
#define HEMC_HECC_IMR_MEM_FIX(value)          (HEMC_HECC_IMR_MEM_FIX_Msk & ((value) << HEMC_HECC_IMR_MEM_FIX_Pos))
#define HEMC_HECC_IMR_MEM_NOFIX_Pos           _U_(1)                                               /**< (HEMC_HECC_IMR) un-fixable error Position */
#define HEMC_HECC_IMR_MEM_NOFIX_Msk           (_U_(0x1) << HEMC_HECC_IMR_MEM_NOFIX_Pos)            /**< (HEMC_HECC_IMR) un-fixable error Mask */
#define HEMC_HECC_IMR_MEM_NOFIX(value)        (HEMC_HECC_IMR_MEM_NOFIX_Msk & ((value) << HEMC_HECC_IMR_MEM_NOFIX_Pos))
#define HEMC_HECC_IMR_Msk                     _U_(0x00000003)                                      /**< (HEMC_HECC_IMR) Register Mask  */


/* -------- HEMC_HECC_FAILAR : (HEMC Offset: 0x190) ( R/ 32) HECC Fail address register -------- */
#define HEMC_HECC_FAILAR_ADDRESS_Pos          _U_(0)                                               /**< (HEMC_HECC_FAILAR) address of the error detected Position */
#define HEMC_HECC_FAILAR_ADDRESS_Msk          (_U_(0xFFFFFFFF) << HEMC_HECC_FAILAR_ADDRESS_Pos)    /**< (HEMC_HECC_FAILAR) address of the error detected Mask */
#define HEMC_HECC_FAILAR_ADDRESS(value)       (HEMC_HECC_FAILAR_ADDRESS_Msk & ((value) << HEMC_HECC_FAILAR_ADDRESS_Pos))
#define HEMC_HECC_FAILAR_Msk                  _U_(0xFFFFFFFF)                                      /**< (HEMC_HECC_FAILAR) Register Mask  */


/** \brief HEMC register offsets definitions */
#define HEMC_CR_NCS0_REG_OFST          (0x00)              /**< (HEMC_CR_NCS0) HEMC Control Register NCS 0 Offset */
#define HEMC_CR_NCS1_REG_OFST          (0x04)              /**< (HEMC_CR_NCS1) HEMC Control Register NCS 1 Offset */
#define HEMC_CR_NCS2_REG_OFST          (0x08)              /**< (HEMC_CR_NCS2) HEMC Control Register NCS 2 Offset */
#define HEMC_CR_NCS3_REG_OFST          (0x0C)              /**< (HEMC_CR_NCS3) HEMC Control Register NCS 3 Offset */
#define HEMC_CR_NCS4_REG_OFST          (0x10)              /**< (HEMC_CR_NCS4) HEMC Control Register NCS 4 Offset */
#define HEMC_CR_NCS5_REG_OFST          (0x14)              /**< (HEMC_CR_NCS5) HEMC Control Register NCS 5 Offset */
#define HEMC_CTRL_REG_OFST             (0x18)              /**< (HEMC_CTRL) HEMC Polarity Control register Offset */
#define HEMC_CRP_NCS0_REG_OFST         (0x20)              /**< (HEMC_CRP_NCS0) HEMC Control Register Protection NCS 0 Offset */
#define HEMC_CRP_NCS1_REG_OFST         (0x24)              /**< (HEMC_CRP_NCS1) HEMC Control Register Protection NCS 1 Offset */
#define HEMC_CRP_NCS2_REG_OFST         (0x28)              /**< (HEMC_CRP_NCS2) HEMC Control Register Protection NCS 2 Offset */
#define HEMC_CRP_NCS3_REG_OFST         (0x2C)              /**< (HEMC_CRP_NCS3) HEMC Control Register Protection NCS 3 Offset */
#define HEMC_CRP_NCS4_REG_OFST         (0x30)              /**< (HEMC_CRP_NCS4) HEMC Control Register Protection NCS 4 Offset */
#define HEMC_CRP_NCS5_REG_OFST         (0x34)              /**< (HEMC_CRP_NCS5) HEMC Control Register Protection NCS 5 Offset */
#define HEMC_IER_REG_OFST              (0x38)              /**< (HEMC_IER) HEMC Interrupt Enable Register Offset */
#define HEMC_IDR_REG_OFST              (0x3C)              /**< (HEMC_IDR) HEMC Interrupt Disable Register Offset */
#define HEMC_IMR_REG_OFST              (0x40)              /**< (HEMC_IMR) HEMC Interrupt Mask Register Offset */
#define HEMC_ISR_REG_OFST              (0x44)              /**< (HEMC_ISR) HEMC Interrupt Status Register Offset */
#define HEMC_SR_REG_OFST               (0x48)              /**< (HEMC_SR) HEMC Status Register Offset */
#define HEMC_HECC_CR0_REG_OFST         (0x100)             /**< (HEMC_HECC_CR0) HECC Control Register Channel 0 (HSMC) Offset */
#define HEMC_HECC_CR1_REG_OFST         (0x104)             /**< (HEMC_HECC_CR1) HECC Control Register Channel 1 (HSDRAMC) Offset */
#define HEMC_HECC_CR2_REG_OFST         (0x108)             /**< (HEMC_HECC_CR2) HECC Control Register Channel 2 (HSDRAMC) Offset */
#define HEMC_HECC_TESTCB0_REG_OFST     (0x140)             /**< (HEMC_HECC_TESTCB0) HECC Test mode Register Channel 0 (HSMC) Offset */
#define HEMC_HECC_TESTCB1_REG_OFST     (0x144)             /**< (HEMC_HECC_TESTCB1) HECC Test mode Register Channel 1 (HSDRAMC) Offset */
#define HEMC_HECC_TESTCB2_REG_OFST     (0x148)             /**< (HEMC_HECC_TESTCB2) HECC Test mode Register Channel 2 (HSDRAMC) Offset */
#define HEMC_HECC_SR_REG_OFST          (0x180)             /**< (HEMC_HECC_SR) HECC Status Register Offset */
#define HEMC_HECC_IER_REG_OFST         (0x184)             /**< (HEMC_HECC_IER) HECC Interrupt Enable Register Offset */
#define HEMC_HECC_IDR_REG_OFST         (0x188)             /**< (HEMC_HECC_IDR) HECC Interrupt Disable Register Offset */
#define HEMC_HECC_IMR_REG_OFST         (0x18C)             /**< (HEMC_HECC_IMR) HECC Interrupt Mask Register Offset */
#define HEMC_HECC_FAILAR_REG_OFST      (0x190)             /**< (HEMC_HECC_FAILAR) HECC Fail address register Offset */

